Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/J55.tmx
Source language: en_us
Languages: zh_cn

source: The beginning of any corpus study is the creation of the corpus itself.The decisions that are taken about what is to be in the corpus, and how the selection is to be organized, control almost everything that happens subsequently. The results are only as good as the corpus.
zh_cn: 任何语料库研究均开始于语料库体的建立，语料库的设计及选材几乎控制以后所要做的一切基于语料库的研究工作，研究结果的好坏只与语料库的建设质量有关。

source: Some features of the source are worth controlling, in a commonsensical way.
zh_cn: 设计者应根据常识知识对所选材料的一些特点进行把握。

source: The specification of a corpus-the types and proportions of material in it-is hardly a job for linguists at all, but more appropriate to the sociology of culture.
zh_cn: 语料库的规格要求——所选材料的类型和比例的确定―― 根本不是语言学的事而更多是文化社会学方面的内容。

source: The stance of the linguist should be a readiness to describe and analyse any instances of language placed before him or her.
zh_cn: 在语言学家看来，语料库语言学就应该描述和分析他们所接触过的所有语言实例。

source: In the infancy of the discipline of corpus linguistics, the linguists have to do the text selection as well; when the impact of the work is felt more widely, it may be possible to hand over this responsibility to language-orientated social scientists.
zh_cn: 在语料库语言学发展初期，需由语言学家做文本的选择工作，当这门学科的影响已经很大时，就应该把这个工作交给以语言研究为主的社会科学家。

source: Certainly the bulk of any lay discussion about corpora concerns the criteria for text selection.
zh_cn: 当然，语料库的规模和设计应考虑文本的选择标准。

source: Until we know a lot more about the effects of our design strategies, we must rely on publishing a list of exactly what is in a corpus (for example, Renouf 1987).
zh_cn: 当我们不确定自己的设计方案的优劣时，我们必须依靠一个已出版的有关语料库的内容确定的表去做。（例如，Renouf，1987）。

source: Users and critics can then consider the constitution and balance of the corpus as a separate matter from the reporting of the linguistic evidence of the corpus.
zh_cn: 用户和评论者可以把语料库的结构及平行性看作是和语料库中的语言实例相分离的东西。

source: I outline below, in the most general terms, the considerations that are relevant to the creation of a corpus of texts.
zh_cn: 接下来我将用最通用的术语来谈谈我对建立文本语料库的一些想法。

source: The first consideration is the aim of the activity of corpus creation.It may be fairly general in providing a good selection of instances of the language for a variety of purposes, which do not need to be enumerated.
zh_cn: 我首先考虑的是建立语料库的目的。一般情况下，建立语料库往往是选出一些好的语言实例可供多方面使用，这就不再多列举。

source: Or it may be specific, as a stage in the development of a product or in the pursuit of a research goal.
zh_cn: 但在产品开发的一个阶段或一个科研项目的研究过程中，可能会有些例外。

source: I shall highlight the construction of general corpora in this chapter, but the application to special needs should be shaped by similar considerations.
zh_cn: 在本章中，我将只谈及通用语料库的建立，而特殊用途语料库的建立也可用相似的方法。

source: The value of a general corpus as a place of reference is very great, and likely to grow dramatically in the coming years.
zh_cn: 一个通用语料库的参考价值很大，在未来几年内这种作用可能会迅速增强。

source: It is now accepted that the documentation of a language, in dictionaries, grammars, etc. is an essential stage in its maturation.
zh_cn: 现在，人们普遍接受这种看法：词典及语法书上的内容趋向文档化，这是语言研究成熟化的一个重要标志。

source: More and more people in every branch of information science are coming to realize that a corpus as a sample of the living language, accessed by sophisticated computers, opens new horizons.
zh_cn: 在信息科学领域，各学科的人们越来越认识到：语料库作为生活语言的抽样可由高级的计算机提供，这将给人们的研究开辟新的途径。

source: The creation of a corpus is a simple matter in outline.
zh_cn: 建立语料库的框架很简单。

source: A decision is taken on a convenient size, and on priorities for selection, then by consulting catalogues, and so on, the text is picked for inclusion.
zh_cn: 首先确定语料库的规模、优先级、参考目录等，然后根据要求挑选文本。

source: Each of these steps will be discussed below, but there are two strictly practical matters that overshadow them.
zh_cn: 下面将详细讨论每一个步骤，但各步骤都受以下两个非常实际的问题影响。

source: One is that a computer-held corpus has to have the material in electronic form, either from print or obtained direct from a text- processing activity which uses computers (printing, word processing, electronic mail, etc.).
zh_cn: 一是将语料库存入计算机中必须有电子版形式的材料，这种材料或者从印刷品中得到，或者直接从计算机处理过的文本中得到（印刷品、词处理材料、电子邮件等）。

source: There are three normal methods of text input at the present time:
zh_cn: 当前，有三种常用的文本输入方式：

source: adaptation of material already in electronic form;
zh_cn: a.整理已经以电子形式存在的材料

source: conversion by optical scanning (machine reading);
zh_cn: b.用光读扫描方式录入转换（机读）

source: conversion by keyboarding.
zh_cn: c.通过键盘输入方式转换

source: Most projects will make use of all three methods, since each is suitable for a different class of material.
zh_cn: 在很多情况下，这三种方式都用得到，因为不同类语料适用于不同的方式。

source: For example, handwritten material and transcriptions of spoken language will require keyboarding, and newsprint can only be economically included if it is available in electronic form.
zh_cn: 例如，手写体材料和话语记录需要键盘输入法 ；但对于新闻材料，如果是电子版形式，可以很经济地选入。

source: For the mass of books printed by conventional methods, scanning is much the best alternative.
zh_cn: 对于大量的用传统方式印刷的书籍，最好选择扫描的方法。

source: Since omnifont scanners (capable of reading any type-face) are still fairly rare and expensive, it is important for project managers to encourage their use, so that they will become more popular and accessible to the average user.
zh_cn: 因为万能扫描仪（能读任何型体的文字）目前还很少且用价很高，所以对项目经理来说鼓励人们使用这种扫描仪将很重要。只有这样，万能扫描仪才能更加大众化，一般用户也能使用。

source: Scanners will always have value because so much print material will never be re-keyboarded.
zh_cn: 扫描仪将会一直很有用，因为如此多的印刷材料永远也无法用键盘输完。

source: However, with modern methods of printing and publishing, there is nearly always an electronic stage.
zh_cn: 然而，即使用现代的出版印刷方法，也需要一个电子化阶段。

source: The originators of the text see this stage merely as a means to an end and rarely keep copies; the researcher should be able to secure co-operation and acquire more and more print material.
zh_cn: 文本的作者视这一个阶段只是一个实现结果的手段而很少保存副本；研究者应该能够得到合作，从而得到越来越多的印刷材料。

source: The other practical problem is the securing of permission to put the text into electronic form, and to quote selections of it in various papers, reports, and other publications.
zh_cn: 另一个实际的问题是得到作者的许可把文本转换成电子版形式，并选用各种论文、报告、及其它出版物中的材料，这是法律较敏感的地方。

source: This is a sensitive area of law and, although one experiences almost unfailing good sense from rights editors, the labour of keeping a large corpus in good legal health is enormous.
zh_cn: 尽管人们从版权编辑处得到相当可靠的感觉，然而很好地、合法地保护一个大规模语料库的工作量是巨大的。

source: It is likely that if copyright holders understood precisely why their texts were desired, and what safeguards there could be against exploitation and piracy, it would be possible to bypass this largely unproductive labour.
zh_cn: 如果版权所有者完全理解为什么有人想用他们的文本而且知道采用什么措施可反盗用，那么就可以回避繁杂而无效的劳动。

source: Until this problem is solved internationally, it is likely to get worse.
zh_cn: 如果这个问题不能在世界范围内得到解决，情况可能会比较糟糕。

source: Some advice can be given in particular instances, but corpus projects should be designed with this in mind as a potential shadow over the enterprise.
zh_cn: 对于一些特殊的情况可以有一些方法，但在语料库的设计过程中，这个隐含的阴影却时刻笼罩在设计者的心头。

source: There are signs that the Council of Europe is alert to this problem and may use its influence to further corpus creation in the languages of Europe.
zh_cn: 一些迹象表明欧洲委员会对这个问题有所警觉，并在用它的影响力去进一步加强欧洲语言的语料库建立。

source: Publishers who have an interest in reference material are contemplating amendments to the normal authorial contract, so that in future there may unnecessary paperwork.
zh_cn: 对参考他人资料感兴趣的出版商正考虑与作者签定正式的授权合同，这样在未来就会减少是否合法的纠纷及不必要的案卷工作。

source: With these practical matters clearly understood, we can turn to the criteria for selection of texts.
zh_cn: 对这些问题的认识越来越清楚，我们更应该注重文本选择标准的确立。

source: In the main, this is applied common sense, but there are some reflections from experience that may be worth considering.
zh_cn: 我们主要用常识知识，但有一些从我们经验中得到的启示很值得我们思考。

source: Perhaps the most far-reaching decision is whether the corpus will contain only written texts, or only spoken transcriptions, or both.
zh_cn: 也许最长远的决定应该是：所建的语料库应该只包括书面文本，或是只包括口语副本，或是两者都包括。

source: Most corpora keep well away from the problems of spoken language -with some honourable exceptions-and, for a corpus which in any way purports to reflect a ‘state of the language’, this is most unfortunate.
zh_cn: 大多数语料库回避口语的诸多问题（除了几个突出的特殊例子），一个语料库随便声称自己可以反映“语言状态”是最不幸的事。

source: Many language scholars and teachers believe that the spoken form of the language is a better guide to the fundamental organization of the language than the written form; and many writers comment on the differences.
zh_cn: 相当多的语言学者和语言老师相信口语形式的语言要比书面形式的语言更能反映语言最基本的组织形式。但也有很多作者持不同观点并写文章对此进行批评。

source: In my own experience, there is no substitute for impromptu speech, and a decision I took in 1961 to assemble a corpus of conversation is one of the luckiest I ever made.
zh_cn: 根据自己的经验我倒认为即时的讲话无法找到替代物，在 1961 年我决定对谈话进行搜集并建成语料库，这是我所做过的最值得庆幸的事之一。

source: Even at that time, I was assured that an automatic transcription of speech was ‘just around the corner’. It still is.
zh_cn: 那个时候我就深信自动生成话语副本已为期不远了，现在仍然如此。

source: If it is impossible in an early stage of a project to collect the spoken language, then there is a temptation to collect film scripts, drama texts, etc., as if they would in some way make up for this deficiency.
zh_cn: 在做这个项目的早期我们不可能搜集口语材料，但可以尝试着搜集电影脚本、剧本等，好象在某些方面用这种方法弥补了一些不足。

source: They have a very limited value in a general corpus, because they are ‘considered’ language, written to simulate speech in artificial settings.
zh_cn: 但在通用语料库中，用这种方法获取的语料库，其价值就很有限。因为它们被视为语言，在人工环境下用书面形式刺激话语。

source: Each has its own distinctive features, but none truly reflects natural conversation, which for many people is the quintessence of the spoken language.
zh_cn: 每一个都有其明显的特征，但哪一个也不能真实地反映真实的对话。而对很多人来说，真实的对话语言才是口语语言的精髓。

source: There is special integrity in a text which is a full record of a public meeting, enquiry, court case, radio or television station, etc., despite the mix of impromptu and considered language that is used scripts and even read-out statements are common.
zh_cn: 在一个文本里如果全面记录了群众大会讲话、问讯、法庭案例审讯、收音机广播和电视转播讲话等，那将是一个特殊的整合体。尽管人们所用到的即席演讲语言和思考后所用的的语言相混合是很正常的：

source: But such records are not likely to be representative of the general usage of conversation.
zh_cn: 一些脚本和大声读出的叙事文，但是这种记录不一定就代表一般谈话所用的语言。

source: The creation of a spoken corpus is not as straightforward as that of a written one, and would require a chapter on its own.
zh_cn: 口语语料库的建立并不象书面语语料库那样简单，它需要专章讨论。

source: Since most corpus activity concerns the written language, I shall concentrate on that in the remainder of this chapter.
zh_cn: 既然大多数语料库的内容都是有关书面语的，我想在本章剩下的部分集中讨论文本语料库的建立。

source: The material will range from formal to informal, from literary to ordinary.
zh_cn: 建库所涉及的语言材料有正式语言也有非正式语言，有文学语言也有日常用语。

source: The formal will be easier to acquire than the informal, and the literary will be more easily noticed than the ordinary.
zh_cn: 正式语言要比非正式的好获取得多，文学语言要比日常语言更容易得到。

source: In general, corpus designers should compensate for this fact.
zh_cn: 一般情况下，在选取语言材料建库时，语料库设计者应想法使语言材料的这种不平衡性得到互补。

source: Ephemeral, and usually informal, written communications are sent through the post, pushed through the letter-box, left in piles in shops, offices, and waiting-rooms, added to packages and piled in our office in-trays in increasing profusion. They are often socially negligible, but they are widespread and typical of mundane prose.
zh_cn: 短暂的、非正式的、为了交际用的书写材料通过邮递传送、通过邮箱发出去，结果在商店里、办公室内、候车厅内、包裹袋上及办公室的文件盘内大量涌现，人们往往忽略它们，但它们传播很广且是典型的常用散文。

source: Equally, it is not necessary to embellish the corpus with all the best pieces of contemporary literary writing. A small amount will suffice.
zh_cn: 为了平衡起见，建库时，应少选正式的文学材料，尽管它们是最好的当代文学材料。

source: The reason is simple and not at all sinister or anti-literary.
zh_cn: 原因很简单，只是因为它们太正式且容易得到，故没有代表性，这一点也没有恶意和反文学的味道。

source: One of the principle uses of a corpus is to identify what is central and typical in the language.
zh_cn: 语料库的重要用途之一是区别出语言中核心的和代表性的东西。

source: This is most valuable as a place of reference against which the work of literary artists can be seriously studied.
zh_cn: 这种语料库作为参考材料很有价值，因为基于这种语料库文学艺术家的著作才可得到认真的研究。

source: However, if the work of established writers was already dominant in the corpus, it would have little or no value as a point of normative reference.
zh_cn: 但是，如果成名作家的作品在语料库中占绝对多的份额，那么从规范参考这一点上来讲，语料库就没有或很少有价值。

source: Further, it is characteristic of literature to innovate, and we may expect a corpus of literary texts to have a low proportion of ordinary, everyday English. And since the processing emphasizes repeated patterns at the expense of unique ones, most of the distinctive literary patterning would be lost, because it would not occur often enough to count as central and typical.
zh_cn: 另外，创新性是文学的特点之一，我们希望建一个文学文本语料库，在这个库中，普通的、日常用语应该占较低的比例，因为建库处理只强调反复出现的模式却以牺牲特例为代价，所以一些典型的文学模式就会被忽略，这主要是因为特例出现的次数少，不足以按照主要的和典型的模式处理。

source: Equally, in journalism the well-known writers tend to have unusual ways of writing, and the more mundane and humdrum sorts of reporting will be more useful in the corpus. This is a minefield of prejudice and misunderstanding.
zh_cn: 同样，在记者行业一些有名的作者倾向于用独特的写作笔法；而在语料库中一些平淡无味的报道则更加有用，这是一种非常危险的偏见和误解。

source: If we are to approach a realistic view of the way in which language is used, we must record the usage of the mass of ordinary writers, and not the stray genius or the astute journalist.
zh_cn: 如果对于语言的用法我们有一种更趋向现实的看法，我们必须记录下大量普通作家语言的使用法而不是少数几个天才和聪明的记者的笔法。

source: Design criteria
zh_cn: 设计的标准：

source: There are many other criteria that can be applied-too many in fact, because each criterion adds substantially to the number of different samples to be obtained.
zh_cn: 事实上有很多很多其它可用的标准，因为每一个标准都将增加很多有本质区别的不同样本语料库。

source: More on this point below.
zh_cn: 关于这一点在后面我将多谈论一些。

source: A discussion of most of the relevant criteria can be found in Renouf (1984), and in the same paper there is a record of the criteria used in the Cobuild project.
zh_cn: 关于语料库标准的讨论在（Renouf 1984）中有很多，并且此论文中记录有Cobuild项目中用到的标准。

source: As a guide, I recommend for a general corpus that any specialized material is either kept out or stored separately as an ancillary corpus.
zh_cn: 作为说明，我认为应该建立通用语料库，而对于某个专业领域的语料就不收入这个通用语料库或者作为辅助语料库单独保存起来。

source: A general reference corpus is not a collection of material from different specialist areas-technical, dialectal, juvenile, etc.
zh_cn: 一个通用参考语料库的材料应该来自不同的专业领域———技术的、方言的、和小孩的语言材料等。

source: It is a collection of material which is broadly homogeneous, but which is gathered from a variety of sources so that the individuality of a source is obscured, unless the researcher isolates a particular text.
zh_cn: 在这样的语料库中，同类材料涉及的面广泛，但这些材料都是来自于不同的渠道，所以材料来源的特点就不那么明显，除非研究者把特殊的文本分开来放。

source: The diversity of sources is an essential safeguard, until such work as Biber’s (1988) categorizations using internal linguistic criteria has advanced sufficiently to allow efficient sampling.
zh_cn: 在Biber's的范畴划分工作之前，保证语料来源的多样性非常重要，Biber的范畴划分是用内部语言的标准来确保抽样有较高的充分性和有效性。

source: Now that newsprint is available in quantity, it must be remembered that the language of newspapers is just one variety of English- of one group of related varieties- and not a reliable sample of the language.
zh_cn: 因为大量的新闻印刷材料容易得到，所以必须记住新闻报纸上的语言只是英语语言的一种形式 ———很多相关变体中的一组———是一个不可靠的抽样。

source: Period
zh_cn: 时期：

source: Most corpora attempt to cover a particular period of time, and use the clearest time indicator, which is the time of first utterance or publication.
zh_cn: 大多数语料库所选语料都试图涵盖某一特定时期，且有很清晰的时间标志，标示出话语是第一次说出的，或文本是第一次出版的。

source: However, if we are trying to sample the material that society has in front of it, then other factors become important.
zh_cn: 然而，如果我们想要抽取的材料受社会的影响比较大，那么其它因素就变的更加重要。

source: A written work may take some time to establish itself, and may remain influential for some time.
zh_cn: 书面材料可能需要一些时间才能确立它的位置，而后可能还要保持一段时间的影响。

source: The phraseology of Shakespeare and the King James Bible still exert an influence on present-day English usage.
zh_cn: 莎士比亚剧中和King James的圣经中所用的词对今天英语的用法还有影响。

source: Overall size
zh_cn: 总规模：

source: The dimensions of a corpus are of prime concern to most researchers in the initial conceptualization, and in the public statements. In the long run, they matter very little.
zh_cn: 在最初的方案设计阶段和向公众说明时，大多数研究人员首先关心的总是语料库的规模大小问题。

source: The only guidance I would give is that a corpus should be as large as possible, and should keep on growing.
zh_cn: 此处我想指明的唯一的一点是语料库应该尽可能的大且应该不断增加。

source: This advice is based on the pattern of word occurrence in texts, first pointed out by Zipf (1935).
zh_cn: 这个看法的根据是文本中词的出现模式，它首先由Zipf(1935)指出。

source: Essentially, there is a huge imbalance in the frequency of the words.
zh_cn: 从本质上来讲，词的出现频率有很大的不平衡性。

source: Most of any text is taken up by words like of, is, up, and by; rather less by like, taken, any, and most; still less by words, less again by text (the example words are the first ten words of this sentence).
zh_cn: 任意一个英文文本的篇幅大都由像of，is，up，和by这样的词占有；像like，taken，any，和most这样的词就少一些；而words这个词则更少，更不用说text这个词了。（例词是下面这个句子的前十个词：Most of any text is taken up by words like of, is, up,and by; rather less by like, taken, any, and most;)。

source: About half of the vocabulary of a text-even a very long text - consists of words that have occurred once only in that text.
zh_cn: 一个文本甚至是很长的文本中大约有一半的词汇是那个文本中只出现过一次的词构成。

source: The relation between words and their frequency is regular.
zh_cn: 词和词频的关系是规则的。

source: The commonest word in English-the-has approximately twice the frequency of the next two, of and and.
zh_cn: 英语中最常用的词the的频率大约是下面两个词of和and的两倍。
